projects.org
#+hugo_base_dir: ./
#+hugo_section: ./projects

#+hugo_weight: auto
#+hugo_auto_set_lastmod: t

#+author: Roger Gonzalez

* Certn - ADA DINER (Adverse Data Aggregator Data INgestER)
:PROPERTIES:
:EXPORT_FILE_NAME: certn-ada-diner
:EXPORT_DATE: 2020-11-01
:ID:       eaec2bc2-4a58-4c36-968e-e1f32b4ad2b3
:END:
** About the project
:PROPERTIES:
:ID:       8c813e2b-593b-49fb-b281-b59e7cf30f4d
:END:
[[https://certn.co][Certn]] is an app that wants to ease the process of background checks for criminal
records, education, employment verification, credit reports, etc. On
ADA DINER we are working on an app that triggers crawls on demand, to check
criminal records for a certain person.
** Tech Stack
:PROPERTIES:
:ID:       3b958a7b-d249-4dc8-9339-2b5296fc1287
:END:
- Python
- Django
- Django REST Framework
- Celery
- PostgreSQL
- Docker-docker/compose
- Swagger
- Github Actions
- Scrapy/Scrapyd
- Jenkins
** What did I work on?
:PROPERTIES:
:ID:       6930fb8e-83c6-4827-a9b4-7ad5ba966ede
:END:
- Dockerized the old app so the development could be more streamlined
- Refactor of old Django code to DRF
- Developed multiple scrapers for multiple police sites in Canada and Interpol
- Created the Github Actions and Jenkins CI configurations

